

words = {
    'ə' : 'e',
    'Ə' : 'E',
    'ı' : 'i',
    'I' : 'İ',
    'ö' : 'O',
    'ö' : 'O',
    'ü' : 'u',
    'Ü' : 'U',
    'ğ' : 'ğ',
    'Ğ' : 'Ğ',
    'ş' : 's',
    'Ş' : 'S',
    'ç' : 'ç',
    'Ç' : 'Ç',
    ' ' : '-',
    ',' : '',
    '.' : '',
    ':' : '',
    ';' : '',
    ':' : '',
    '!' : '',
    '?' : '',
    '(' : '',
    ')' : '',
    '{' : '',
    '}' : '',
    '[' : '',
    ']' : '',
    '"' : '',
    '' : '',
    '`' : '',





}


def generate_slug(title):
    for key, value in words.items():
        title = title.replace(key,value)
    return title.lower()